<a href="https://colab.research.google.com/github/Jojomaque/Portfolio/blob/main/JojoData_Investigation_Project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data investigation project
---

Use what you have learnt so far about reading data files and displaying rows, columns, unique values, etc, to investigate and produce some printed information from this data set: https://raw.githubusercontent.com/futureCodersSE/working-with-data/main/Data%20sets/housing_in_london_yearly_variables.csv

In [ ]:
import pandas as pd
url = "https://raw.githubusercontent.com/futureCodersSE/working-with-data/main/Data%20sets/housing_in_london_yearly_variables.csv"
df = pd.read_csv(url)
# Viewing a sample of the dataset
df.head(50)
df.dtypes

#issues - data cleaning
#mean salary is not numerical

code                  object
area                  object
date                  object
median_salary        float64
life_satisfaction    float64
mean_salary           object
recycling_pct         object
population_size      float64
number_of_jobs       float64
area_size            float64
no_of_houses         float64
borough_flag           int64
dtype: object

In [1]:
import pandas as pd
url = "https://raw.githubusercontent.com/futureCodersSE/working-with-data/main/Data%20sets/housing_in_london_yearly_variables.csv"
df = pd.read_csv(url)
# Viewing a sample of the dataset
df.head(5)

        code                  area  ... no_of_houses  borough_flag
0  E09000001        city of london  ...          NaN             1
1  E09000002  barking and dagenham  ...          NaN             1
2  E09000003                barnet  ...          NaN             1
3  E09000004                bexley  ...          NaN             1
4  E09000005                 brent  ...          NaN             1

[5 rows x 12 columns]

In [2]:
# The method info() gives us information about the df such as the data type and the number of missing values in each attribute:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1071 entries, 0 to 1070
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   code               1071 non-null   object
 1   area               1071 non-null   object
 2   date               1071 non-null   object
 3   median_salary      1049 non-null   float64
 4   life_satisfaction  352 non-null    float64
 5   mean_salary        1071 non-null   object
 6   recycling_pct      860 non-null    object
 7   population_size    1018 non-null   float64
 8   number_of_jobs     931 non-null    float64
 9   area_size          666 non-null    float64
 10  no_of_houses       666 non-null    float64
 11  borough_flag       1071 non-null   int64
dtypes: float64(6), int64(1), object(5)
memory usage: 100.5+ KB

In [3]:
# Considering the null values present in the data set.
df.isnull().sum()

code                   0
area                   0
date                   0
median_salary         22
life_satisfaction    719
mean_salary            0
recycling_pct        211
population_size       53
number_of_jobs       140
area_size            405
no_of_houses         405
borough_flag           0
dtype: int64

Use the describe() method to get various summary statistics that exclude NaN values.

In [4]:
df.describe()

       median_salary  life_satisfaction  ...  no_of_houses  borough_flag
count    1049.000000         352.000000  ...  6.660000e+02   1071.000000
mean    27977.792183           7.485057  ...  8.814682e+05      0.647059
std      6412.807487           0.198451  ...  3.690376e+06      0.478108
min     15684.000000           7.000000  ...  5.009000e+03      0.000000
25%     23857.000000           7.350000  ...  8.763550e+04      0.000000
50%     27441.000000           7.510000  ...  1.024020e+05      1.000000
75%     30932.000000           7.640000  ...  1.262760e+05      1.000000
max     61636.000000           7.960000  ...  2.417217e+07      1.000000

[8 rows x 7 columns]

NameError: ignored

In [ ]:
# Finding out the min and max dates
print(df['date'].min())
print(df['date'].max())
print(df['date'].unique())

1999-12-01
2019-12-01
['1999-12-01' '2000-12-01' '2001-12-01' '2002-12-01' '2003-12-01'
 '2004-12-01' '2005-12-01' '2006-12-01' '2007-12-01' '2008-12-01'
 '2009-12-01' '2010-12-01' '2011-12-01' '2012-12-01' '2013-12-01'
 '2014-12-01' '2015-12-01' '2016-12-01' '2017-12-01' '2018-12-01'
 '2019-12-01']

In [ ]:
# Viewing the available areas that are in the london boroughs as some of the areas are elsewhere in the UK
london_borough = df[df['borough_flag'] == True]['area'].unique()
print(london_borough)
other_zones = df[df['borough_flag'] == False]['area'].unique()
print(other_zones)

['city of london' 'barking and dagenham' 'barnet' 'bexley' 'brent'
 'bromley' 'camden' 'croydon' 'ealing' 'enfield' 'greenwich' 'hackney'
 'hammersmith and fulham' 'haringey' 'harrow' 'havering' 'hillingdon'
 'hounslow' 'islington' 'kensington and chelsea' 'kingston upon thames'
 'lambeth' 'lewisham' 'merton' 'newham' 'redbridge' 'richmond upon thames'
 'southwark' 'sutton' 'tower hamlets' 'waltham forest' 'wandsworth'
 'westminster']
['north east' 'north west' 'yorkshire and the humber' 'east midlands'
 'west midlands' 'east' 'london' 'south east' 'south west' 'inner london'
 'outer london' 'england' 'united kingdom' 'great britain'
 'england and wales' 'northern ireland' 'scotland' 'wales']